; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph3 - mode
	spectrograph1 - mode
	image2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(supports instrument0 image2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 142)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image2)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 186)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 146)
	(= (data Phenomenon4 spectrograph3) 43)
	(= (data Phenomenon5 spectrograph3) 101)
	(= (data Star6 spectrograph3) 238)
	(= (data Phenomenon7 spectrograph3) 147)
	(= (data Phenomenon8 spectrograph3) 55)
	(= (data Phenomenon9 spectrograph3) 89)
	(= (data Phenomenon4 spectrograph1) 148)
	(= (data Phenomenon5 spectrograph1) 285)
	(= (data Star6 spectrograph1) 222)
	(= (data Phenomenon7 spectrograph1) 191)
	(= (data Phenomenon8 spectrograph1) 229)
	(= (data Phenomenon9 spectrograph1) 199)
	(= (data Phenomenon4 image2) 260)
	(= (data Phenomenon5 image2) 297)
	(= (data Star6 image2) 265)
	(= (data Phenomenon7 image2) 287)
	(= (data Phenomenon8 image2) 9)
	(= (data Phenomenon9 image2) 224)
	(= (data Phenomenon4 thermograph0) 116)
	(= (data Phenomenon5 thermograph0) 49)
	(= (data Star6 thermograph0) 245)
	(= (data Phenomenon7 thermograph0) 90)
	(= (data Phenomenon8 thermograph0) 218)
	(= (data Phenomenon9 thermograph0) 186)
	(= (slew_time Star2 GroundStation0) 42.88)
	(= (slew_time GroundStation0 Star2) 42.88)
	(= (slew_time Star2 Star1) 17.29)
	(= (slew_time Star1 Star2) 17.29)
	(= (slew_time GroundStation3 GroundStation0) 33.35)
	(= (slew_time GroundStation0 GroundStation3) 33.35)
	(= (slew_time GroundStation3 Star1) 44.03)
	(= (slew_time Star1 GroundStation3) 44.03)
	(= (slew_time GroundStation3 Star2) 21.82)
	(= (slew_time Star2 GroundStation3) 21.82)
	(= (slew_time Star1 GroundStation0) 4.249)
	(= (slew_time GroundStation0 Star1) 4.249)
	(= (slew_time Phenomenon4 GroundStation0) 55)
	(= (slew_time GroundStation0 Phenomenon4) 55)
	(= (slew_time Phenomenon4 Star1) 15.69)
	(= (slew_time Star1 Phenomenon4) 15.69)
	(= (slew_time Phenomenon4 Star2) 24.53)
	(= (slew_time Star2 Phenomenon4) 24.53)
	(= (slew_time Phenomenon4 GroundStation3) 65.88)
	(= (slew_time GroundStation3 Phenomenon4) 65.88)
	(= (slew_time Phenomenon5 GroundStation0) 58.26)
	(= (slew_time GroundStation0 Phenomenon5) 58.26)
	(= (slew_time Phenomenon5 Star1) 36.84)
	(= (slew_time Star1 Phenomenon5) 36.84)
	(= (slew_time Phenomenon5 Star2) 28.17)
	(= (slew_time Star2 Phenomenon5) 28.17)
	(= (slew_time Phenomenon5 GroundStation3) 87.79)
	(= (slew_time GroundStation3 Phenomenon5) 87.79)
	(= (slew_time Phenomenon5 Phenomenon4) 12.52)
	(= (slew_time Phenomenon4 Phenomenon5) 12.52)
	(= (slew_time Star6 GroundStation0) 51.94)
	(= (slew_time GroundStation0 Star6) 51.94)
	(= (slew_time Star6 Star1) 65.57)
	(= (slew_time Star1 Star6) 65.57)
	(= (slew_time Star6 Star2) 4.047)
	(= (slew_time Star2 Star6) 4.047)
	(= (slew_time Star6 GroundStation3) 14.27)
	(= (slew_time GroundStation3 Star6) 14.27)
	(= (slew_time Star6 Phenomenon4) 10.19)
	(= (slew_time Phenomenon4 Star6) 10.19)
	(= (slew_time Star6 Phenomenon5) 51.69)
	(= (slew_time Phenomenon5 Star6) 51.69)
	(= (slew_time Phenomenon7 GroundStation0) 48.61)
	(= (slew_time GroundStation0 Phenomenon7) 48.61)
	(= (slew_time Phenomenon7 Star1) 31.52)
	(= (slew_time Star1 Phenomenon7) 31.52)
	(= (slew_time Phenomenon7 Star2) 6.614)
	(= (slew_time Star2 Phenomenon7) 6.614)
	(= (slew_time Phenomenon7 GroundStation3) 29.13)
	(= (slew_time GroundStation3 Phenomenon7) 29.13)
	(= (slew_time Phenomenon7 Phenomenon4) 15.8)
	(= (slew_time Phenomenon4 Phenomenon7) 15.8)
	(= (slew_time Phenomenon7 Phenomenon5) 48.39)
	(= (slew_time Phenomenon5 Phenomenon7) 48.39)
	(= (slew_time Phenomenon7 Star6) 23.31)
	(= (slew_time Star6 Phenomenon7) 23.31)
	(= (slew_time Phenomenon8 GroundStation0) 30.3)
	(= (slew_time GroundStation0 Phenomenon8) 30.3)
	(= (slew_time Phenomenon8 Star1) 21.42)
	(= (slew_time Star1 Phenomenon8) 21.42)
	(= (slew_time Phenomenon8 Star2) 9.127)
	(= (slew_time Star2 Phenomenon8) 9.127)
	(= (slew_time Phenomenon8 GroundStation3) 26.28)
	(= (slew_time GroundStation3 Phenomenon8) 26.28)
	(= (slew_time Phenomenon8 Phenomenon4) 75.37)
	(= (slew_time Phenomenon4 Phenomenon8) 75.37)
	(= (slew_time Phenomenon8 Phenomenon5) 39.07)
	(= (slew_time Phenomenon5 Phenomenon8) 39.07)
	(= (slew_time Phenomenon8 Star6) 10.27)
	(= (slew_time Star6 Phenomenon8) 10.27)
	(= (slew_time Phenomenon8 Phenomenon7) 12.75)
	(= (slew_time Phenomenon7 Phenomenon8) 12.75)
	(= (slew_time Phenomenon9 GroundStation0) 45.92)
	(= (slew_time GroundStation0 Phenomenon9) 45.92)
	(= (slew_time Phenomenon9 Star1) 46.86)
	(= (slew_time Star1 Phenomenon9) 46.86)
	(= (slew_time Phenomenon9 Star2) 30.88)
	(= (slew_time Star2 Phenomenon9) 30.88)
	(= (slew_time Phenomenon9 GroundStation3) 64.53)
	(= (slew_time GroundStation3 Phenomenon9) 64.53)
	(= (slew_time Phenomenon9 Phenomenon4) 53.97)
	(= (slew_time Phenomenon4 Phenomenon9) 53.97)
	(= (slew_time Phenomenon9 Phenomenon5) 50.9)
	(= (slew_time Phenomenon5 Phenomenon9) 50.9)
	(= (slew_time Phenomenon9 Star6) 13.99)
	(= (slew_time Star6 Phenomenon9) 13.99)
	(= (slew_time Phenomenon9 Phenomenon7) 27.01)
	(= (slew_time Phenomenon7 Phenomenon9) 27.01)
	(= (slew_time Phenomenon9 Phenomenon8) 54.85)
	(= (slew_time Phenomenon8 Phenomenon9) 54.85)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 spectrograph1)
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 spectrograph3)
	(have_image Phenomenon7 image2)
	(have_image Phenomenon9 spectrograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 142 to 76.43, (fuel-used) from 0 to 65.57
   goals met: 0 of 5
2. (turn_to satellite2 star1 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 146 to 109.16, (fuel-used) from 65.57 to 102.41
   goals met: 0 of 5
3. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 5
4. (calibrate satellite2 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 5
5. (turn_to satellite2 phenomenon5 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 109.16 to 72.32, (fuel-used) from 102.41 to 139.25
   goals met: 0 of 5
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
7. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 76.43 to 72.383, (fuel-used) from 139.25 to 143.297
   goals met: 0 of 5
8. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 72.383 to 68.336, (fuel-used) from 143.297 to 147.344
   goals met: 0 of 5
9. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 68.336 to 64.289, (fuel-used) from 147.344 to 151.391
   goals met: 0 of 5
10. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 64.289 to 60.242, (fuel-used) from 151.391 to 155.438
   goals met: 0 of 5
11. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 60.242 to 56.195, (fuel-used) from 155.438 to 159.485
   goals met: 0 of 5
12. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 56.195 to 52.148, (fuel-used) from 159.485 to 163.532
   goals met: 0 of 5
13. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 52.148 to 48.101, (fuel-used) from 163.532 to 167.579
   goals met: 0 of 5
14. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 48.101 to 44.054, (fuel-used) from 167.579 to 171.626
   goals met: 0 of 5
15. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 44.054 to 40.007, (fuel-used) from 171.626 to 175.673
   goals met: 0 of 5
16. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 40.007 to 35.96, (fuel-used) from 175.673 to 179.72
   goals met: 0 of 5
17. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 35.96 to 31.913, (fuel-used) from 179.72 to 183.767
   goals met: 0 of 5
18. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 31.913 to 27.866, (fuel-used) from 183.767 to 187.814
   goals met: 0 of 5
19. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 27.866 to 23.819, (fuel-used) from 187.814 to 191.861
   goals met: 0 of 5
20. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 23.819 to 19.772, (fuel-used) from 191.861 to 195.908
   goals met: 0 of 5
21. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 19.772 to 15.725, (fuel-used) from 195.908 to 199.955
   goals met: 0 of 5
22. (turn_to satellite1 phenomenon9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 186 to 158.99, (fuel-used) from 199.955 to 226.965
   goals met: 0 of 5
23. (turn_to satellite1 star2 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 158.99 to 128.11, (fuel-used) from 226.965 to 257.845
   goals met: 0 of 5
24. (turn_to satellite1 star6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 128.11 to 124.063, (fuel-used) from 257.845 to 261.892
   goals met: 0 of 5
25. (turn_to satellite1 groundstation3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 124.063 to 109.793, (fuel-used) from 261.892 to 276.162
   goals met: 0 of 5
26. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
27. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 5
28. (turn_to satellite1 star6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 109.793 to 95.523, (fuel-used) from 276.162 to 290.432
   goals met: 0 of 5
29. (turn_to satellite1 phenomenon9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 95.523 to 81.533, (fuel-used) from 290.432 to 304.422
   goals met: 0 of 5
30. (take_image satellite1 phenomenon9 instrument1 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   changed: (data_capacity satellite1) from 1000 to 911, (data-stored) from 0 to 89
   goals met: 1 of 5
31. (turn_to satellite1 star6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 81.533 to 67.543, (fuel-used) from 304.422 to 318.412
   goals met: 1 of 5
32. (take_image satellite1 star6 instrument1 spectrograph3)
   added: (have_image star6 spectrograph3)
   changed: (data_capacity satellite1) from 911 to 673, (data-stored) from 89 to 327
   goals met: 2 of 5
33. (turn_to satellite1 groundstation3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 67.543 to 53.273, (fuel-used) from 318.412 to 332.682
   goals met: 2 of 5
34. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 2 of 5
35. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 5
36. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 5
37. (turn_to satellite1 phenomenon7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 53.273 to 24.143, (fuel-used) from 332.682 to 361.812
   goals met: 2 of 5
38. (take_image satellite1 phenomenon7 instrument2 image2)
   added: (have_image phenomenon7 image2)
   changed: (data_capacity satellite1) from 673 to 386, (data-stored) from 327 to 614
   goals met: 3 of 5
39. (turn_to satellite1 phenomenon4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 24.143 to 8.343, (fuel-used) from 361.812 to 377.612
   goals met: 3 of 5
40. (take_image satellite2 phenomenon5 instrument3 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   changed: (data_capacity satellite2) from 1000 to 951, (data-stored) from 614 to 663
   goals met: 4 of 5
41. (take_image satellite1 phenomenon4 instrument2 spectrograph1)
   added: (have_image phenomenon4 spectrograph1)
   changed: (data_capacity satellite1) from 386 to 238, (data-stored) from 663 to 811
   goals met: 5 of 5
